// Пример - Команды перемещения по строкам текущего набора данных. Технополис 2017
// Вы можете перемещать курсор по строка с данными текущего объекта.

var Jewel = Java.type("Jewel.Master");
var kd = new Jewel(data);

// первая строка
kd.firstRow();
// последняя строка
//kd.lastRow();
// следующая строка
//kd.nextRow();
// предыдущая строка
//kd.priorRow();
// вставить строку
//kd.insertRow();
// удалить строку
//kd.deleteRow();
// сохранить строку
//kd.saveRow();
// дублировать строку
//kd.copyRow();
// поиск строки
//kd.locateRow();
